# Axis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revolution..::..Axis Property
Revolution Class See Also
---
Returns the Axis of the Revolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelLine Axis { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Axis As ModelLine
	Get
```

Visual C++
---
```text
public:
property ModelLine^ Axis {
	ModelLine^ get ();
}
```

# Remarks
This property is used to retrieve the Axis of the Revolution.
# See Also
Revolution Class
Autodesk.Revit.DB Namespace